Revit 2024 API
BuiltInFailures.StairRampFailures.MultistoryStairsComponentJoinFailure Property
 Can't keep elements joined. Avoid converting stairs to skeched-based component in Multistory stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MultistoryStairsComponentJoinFailure { get; }
Visual Basic
Public Shared ReadOnly Property MultistoryStairsComponentJoinFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MultistoryStairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace